depth_multiple: 0.33  # model depth multiple
width_multiple: 0.375  # layer channel multiple

backbone:
  # [from, number, module, args]
  [[-1, 1, RepVGGBlock, [64, 3, 2]],  # 0-P1/2 channel: 24
   [-1, 1, RepVGGBlock, [128, 3, 2]],  # 1-P2/4  channel: 48
   [-1, 1, RepGhostC3, [128, 192, 2, 3]],
   [-1, 1, RepVGGBlock, [256, 3, 2]],  # 3-P3/8  channel: 96
   [-1, 1, RepGhostC3, [256, 384, 2, 5, 0.25]],
   [-1, 1, RepVGGBlock, [512, 3, 2]],  # 5-P4/16
   [-1, 1, RepGhostC3, [512, 768, 6, 3]],
   [-1, 1, RepVGGBlock, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, RepGhostC3, [1024, 2560, 5, 5, 0.25]],  #RepGhostC3 [out_channel,mid_channel,num_block,dw_kernel_size,se_ratio] mid_channel set by yourself
   [-1, 1, SimSPPF, [1024, 5]]]  # 9

neck:
  [[-1, 1, SimConv, [256, 1, 1]],
   [-1, 1, Transpose, [256]],
   [[-1, 6], 1, Concat, [1]],
   [-1, 1, RepGhostC3, [256, 384, 4]],

   [-1, 1, SimConv, [128, 1, 1]],
   [-1, 1, Transpose, [128]],
   [[-1, 4], 1, Concat, [1]],
   [-1, 1, RepGhostC3, [128, 192, 4]],   #out

   [-1, 1, SimConv, [128, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 1, RepGhostC3, [256, 384, 4]],  # 20 (P4/16-medium)

   [-1, 1, SimConv, [256, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 1, RepGhostC3, [512, 768, 4]]]  # 23 (P5/32-large)

effidehead:
  [[17, 1, Head_layers, [128, 0]],#if use_dfl is False, please set reg_max to 0
  [20, 1, Head_layers, [256, 0]],
  [23, 1, Head_layers, [512, 0]],
  [[24, 25, 26],1,Out, []]]




