# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [19,27,  44,40,  38,94]  # P3/8
  - [96,68,  86,152,  180,137]  # P4/16
  - [140,301,  303,264,  238,542]  # P5/32


# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
   [-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],  #####
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]], ######4
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]], ########
   [ -1, 1, Conv, [ 768, 3, 2 ] ],  # 7-P5/32
   [ -1, 3, C3, [ 768 ] ],
   [-1, 1, Conv, [1024, 3, 2]],  # 9-P5/32
   [-1, 3, C3, [1024]],

   [[1,2],1,Add_down,[128,128,0]],
   [[1,4],1,Add_down,[256,128,2]],
   [[1,6],1,Add_down,[512,128,4]],
    [[1,8],1,Add_down,[768,128,8]],
    [[1,10],1,Add_down,[1024,128,16]],   #15
   [ -1, 1, BepC3   , [ 128, 128, 6, 0.5 ] ],  #16
   [-1, 1, RepVGGBlockv6, [256, 3, 2]],  # 3-P3/8
    [[-1,4],1,Add_down,[256,256,0]],
   [[-1,6],1,Add_down,[512,256,2]],
    [[-1,8],1,Add_down,[768,256,4]],
    [[-1,10],1,Add_down,[1024,256,9]],
   [ -1, 1, BepC3   , [ 256, 256, 12, 0.5 ] ],  #  22

   [-1, 1, RepVGGBlockv6, [512, 3, 2]],  # 5-P4/16
   [[-1,6],1,Add_down,[512,512,0]],
   [[-1,8],1,Add_down,[768,512,2]],
    [[-1,10],1,Add_down,[1024,512,4]],
   [ -1, 1, BepC3   , [ 512, 512,18,0.5 ] ],   #####27
   [-1, 1, RepVGGBlockv6, [768, 3, 2]],  # 7-P5/32
   [[-1,8],1,Add_down,[768,768,0]],
    [[-1,10],1,Add_down,[1024,768,2]],
   [ -1, 1, BepC3   , [ 768, 768,6,0.5 ] ],   #31
    [-1, 1, RepVGGBlockv6, [1024, 3, 2]],  # 7-P5/32
      [[-1,10],1,Add_down,[1024,1024,0]],
    [ -1, 1, BepC3   , [ 1024, 1024,6,0.5 ] ],  #34
    [-1, 1, SPPCSPC, [1024]],  # 35

  ]

# YOLOv5 v6.0 head
head:
  [
   [-1, 1, Conv, [768, 1, 1]],  #36
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 31, 8], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [768, False]],  # 1

   [-1, 1, Conv, [512, 1, 1]],  #40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 27, 6 ], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [512, False]],  # 17 (P3/8-small)

   [ -1, 1, Conv, [ 256, 1, 1 ] ],  #44
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
   [ [ -1, 22, 4 ], 1, Concat, [ 1 ] ],  # cat backbone P3
   [ -1, 3, C3, [ 256, False ] ],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],  #48
   [[-1, 44], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512,False]],  # 20 (P4/16-medium)

   [ -1, 1, Conv, [ 512, 3, 2 ] ],  #51
   [ [ -1, 40 ], 1, Concat, [ 1 ] ],  # cat head P4
   [ -1, 3, C3, [ 768,False ] ],  # 20 (P4/16-medium)

   [-1, 1, Conv, [768, 3, 2]],  #54
   [[-1, 36], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024,False]],  # 23 (P5/32-large)

   [[47,50,53,56], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5, P6)
  ]





