# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [19,27,  44,40,  38,94]  # P3/8
  - [96,68,  86,152,  180,137]  # P4/16
  - [140,301,  303,264,  238,542]  # P5/32


# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
   [-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],  #####
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]], ######4
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]], ########
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9

   [[1,2],1,Add_down,[128,128,0]],
   [[1,4],1,Add_down,[256,128,2]],
   [[1,6],1,Add_down,[512,128,4]],
    [[1,8],1,Add_down,[1024,128,8]],
#   [-1, 1, E_ELAN, [128]],   #cin 128  cout 256   13
   [ -1, 1, BepC3   , [ 128, 128, 6, 0.5 ] ],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
      [[-1,4],1,Add_down,[256,256,0]],
   [[-1,6],1,Add_down,[512,256,2]],
    [[-1,8],1,Add_down,[1024,256,4]],
   [ -1, 1, BepC3   , [ 256, 256, 12, 0.5 ] ],  #cin 128  cout 256   13

   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [[-1,6],1,Add_down,[512,512,0]],
   [[-1,8],1,Add_down,[1024,512,2]],
   [ -1, 1, BepC3   , [ 512, 512,18,0.5 ] ],   #####18
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [[-1,8],1,Add_down,[1024,1024,0]],
   [ -1, 1, BepC3   , [ 1024, 1024,6,0.5 ] ],
   [-1, 1, SPPCSPC, [1024]],  # 24

  ]

# YOLOv5 v6.0 head
head:
  [
   [-1, 1, Conv, [512, 1, 1]],  #25
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 23, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],  #29
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 19, 4 ], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],  #33
   [[-1, 32], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512,False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],  #36
   [[-1, 28], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [512,False]],  # 23 (P5/32-large)

   [[35, 38, 41], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5, P6)
  ]














## YOLOv5 🚀 by Ultralytics, GPL-3.0 license
#
## Parameters
#nc: 8  # number of classes
#depth_multiple: 1.0  # model depth multiple
#width_multiple: 1.0  # layer channel multiple
#anchors:
#  - [19,27,  44,40,  38,94]  # P3/8
#  - [40,68,  36,76,  180,137]  # P4/16
#  - [80,74,  90,100,  120,150]  # P5/32
#  - [140,167,  178,290,  200,180]  # P6/64
#
## YOLOv5 v6.0 backbone
#backbone:
#  # [from, number, module, args]
#  [
#   [-1,1, Input,[]],
#   [ -1, 1, CSPResNet_CBS, [ 3, 64, True ] ],  #0 /2
#   [ -1, 1, CSPResNet, [ 64, 128, 3, 2, 'backbone' ] ],  #1  /4
#   [ -1, 1, CSPResNet, [ 128, 256, 6, 2, 'backbone' ] ],  #2 cat /8 out
#   [ -1, 1, CSPResNet, [ 256, 512, 3, 2, 'backbone' ] ],  #3 cat  /16 out
#   [ -1, 1, CSPResNet, [ 512, 768, 3, 2, 'backbone' ] ],  #3 cat  /16 out
#   [ -1, 1, CSPResNet, [ 768, 1024, 3, 2, 'backbone' ] ],  #4  /32
#   [-1, 1, SPPF, [1024, 5]],  ##########7
#
#   [ 0, 1, Conv, [ 64, 6, 2, 2 ] ],  # 0-P1/2
#   [ -1, 1, Conv, [ 128, 3, 2 ] ],  # 1-P2/4
#   [ -1, 3, C3, [ 128 ] ],
#     [[-1, 2] ,1,Add, [128]],
#
#   [ -1, 1, Conv, [ 256, 3, 2 ] ],  # 3-P3/8
#   [ -1, 6, C3, [ 256 ] ],
#        [[-1, 3] ,1,Add, [256]],
#   [ -1, 1, Conv, [ 512, 3, 2 ] ],  # 5-P4/16
#   [ -1, 9, C3, [ 512 ] ],
#        [[-1, 4] ,1,Add, [512]],
#   [ -1, 1, Conv, [ 768, 3, 2 ] ],  # 7-P5/32       17
#   [ -1, 3, C3, [ 768 ] ],
#        [[-1, 5] ,1,Add, [768]],
#   [ -1, 1, Conv, [ 1024, 3, 2 ] ],  # 9-P6/64
#   [ -1, 3, C3, [ 1024 ] ],
#   [ -1, 1, SPPF, [ 1024, 5 ] ],  # 11
#        [[-1, 7] ,1,Add, [1024]],
#
#  ]
#
## YOLOv5 v6.0 head
#head:
#  [
#   [-1, 1, Conv, [768, 1, 1]], ####24
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 18], 1, Concat, [1]],  # cat backbone P5
#   [-1, 3, C3, [768, False]],  # 15
#
#   [-1, 1, Conv, [512, 1, 1]],
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 15], 1, Concat, [1]],  # cat backbone P4
#   [-1, 3, C3, [512, False]],  # 19
#
#   [-1, 1, Conv, [256, 1, 1]], ##########32
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 12], 1, Concat, [1]],  # cat backbone P3
#   [-1, 3, C3, [256, False]],  # 23 (P3/8-small)
#
#   [-1, 1, Conv, [256, 3, 2]],
#   [[-1, 32], 1, Concat, [1]],  # cat head P4
#   [-1, 3, C3, [512, False]],  # 26 (P4/16-medium)       38
#
#   [-1, 1, Conv, [512, 3, 2]],
#   [[-1, 28], 1, Concat, [1]],  # cat head P5
#   [-1, 3, C3, [768, False]],  # 29 (P5/32-large)
#
#   [-1, 1, Conv, [768, 3, 2]],
#   [[-1, 24], 1, Concat, [1]],  # cat head P6
#   [-1, 3, C3, [1024, False]],  # 32 (P6/64-xlarge)
#
#   ###############
#   [ -1, 1, Conv, [ 768, 1, 1 ] ], ####45
#   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
#   [ [ -1, 5 ], 1, Concat, [ 1 ] ],  # cat backbone P5
#   [ -1, 3, C3, [ 768, False ] ],  # 15
#
#   [ -1, 1, Conv, [ 512, 1, 1 ] ],  #49
#   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
#   [ [ -1, 4 ], 1, Concat, [ 1 ] ],  # cat backbone P4
#   [ -1, 3, C3, [ 512, False ] ],  # 19
#
#   [ -1, 1, Conv, [ 256, 1, 1 ] ], ##########53
#   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
#   [ [ -1, 3 ], 1, Concat, [ 1 ] ],  # cat backbone P3
#   [ -1, 3, C3, [ 256, False ] ],  # 23 (P3/8-small)
#
#   [ -1, 1, Conv, [ 256, 3, 2 ] ],
#   [ [ -1, 53 ], 1, Concat, [ 1 ] ],  # cat head P4
#   [ -1, 3, C3, [ 512, False ] ],  # 26 (P4/16-medium)       38
#
#   [ -1, 1, Conv, [ 512, 3, 2 ] ],
#   [ [ -1, 49 ], 1, Concat, [ 1 ] ],  # cat head P5
#   [ -1, 3, C3, [ 768, False ] ],  # 29 (P5/32-large)
#
#   [ -1, 1, Conv, [ 768, 3, 2 ] ],
#   [ [ -1, 45 ], 1, Concat, [ 1 ] ],  # cat head P6
#   [ -1, 3, C3, [ 1024, False ] ],  # 32 (P6/64-xlarge)
#
#   [[35, 38, 41, 44,   57,60,63,66], 1, IAuxDetect, [nc, anchors]],  # Detect(P3, P4, P5, P6)
#  ]
